###### Introduction of Pandas

###### Series & DataFrame

###### Creation of  Dataframes,Exploring Data(Series and DataFrame)

###### Operations on DataFrames

In [1]:
import pandas as pd
import numpy as np

### Series

#### A one-dimensional array like structure along with indices as label.

In [2]:
s1 = pd.Series([40,5,20,41,26,10])
s1

0    40
1     5
2    20
3    41
4    26
5    10
dtype: int64

In [3]:
print(s1[0])

40

In [5]:
print(s1[0:3])

0    40
1     5
2    20
dtype: int64

In [6]:
print(s1[0::2])

0    40
2    20
4    26
dtype: int64

### DataFrame

#### A Multi-Dimensional (2D) array like structure along with indices as label.

In [7]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [8]:
df = pd.DataFrame(
    {
        'name': ["pj","hb","jb"],
        'age': [20,30,15],
        'marks': [98,94,90],
    }
)

df

  name  age  marks
0   pj   20     98
1   hb   30     94
2   jb   15     90

In [10]:
df["name"]

0    pj
1    hb
2    jb
Name: name, dtype: object

In [11]:
df["age"]

0    20
1    30
2    15
Name: age, dtype: int64

In [12]:
df["marks"]

0    98
1    94
2    90
Name: marks, dtype: int64

In [13]:
df[["name","age","marks"]]

  name  age  marks
0   pj   20     98
1   hb   30     94
2   jb   15     90

In [14]:
df["name"][0]

'pj'

In [15]:
df["marks"]

0    98
1    94
2    90
Name: marks, dtype: int64

In [16]:
df

  name  age  marks
0   pj   20     98
1   hb   30     94
2   jb   15     90

In [17]:
df["city"] = ["Rajkot","Ahmedabad","Baroda"]
df

  name  age  marks       city
0   pj   20     98     Rajkot
1   hb   30     94  Ahmedabad
2   jb   15     90     Baroda

In [18]:
print(df)

  name  age  marks       city
0   pj   20     98     Rajkot
1   hb   30     94  Ahmedabad
2   jb   15     90     Baroda

In [19]:
df["age"].dtypes

dtype('int64')

In [20]:
df.dtypes

name     object
age       int64
marks     int64
city     object
dtype: object

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
type(s1)

pandas.core.series.Series

In [23]:
df["marks"] + 2

0    100
1     96
2     92
Name: marks, dtype: int64

In [27]:
df["marks"] - 2

0    96
1    92
2    88
Name: marks, dtype: int64

In [28]:
df["marks"] / 2

0    49.0
1    47.0
2    45.0
Name: marks, dtype: float64

In [29]:
df["marks"] * 2

0    196
1    188
2    180
Name: marks, dtype: int64

In [30]:
df["marks"] % 2

0    0
1    0
2    0
Name: marks, dtype: int64

In [31]:
df

  name  age  marks       city
0   pj   20     98     Rajkot
1   hb   30     94  Ahmedabad
2   jb   15     90     Baroda

In [32]:
df["marks"] = df["marks"] + 2

In [33]:
df

  name  age  marks       city
0   pj   20    100     Rajkot
1   hb   30     96  Ahmedabad
2   jb   15     92     Baroda

In [34]:
type(df["marks"])

pandas.core.series.Series

In [35]:
df2 = pd.DataFrame(
    [
        ["Pujen","Naitik","Aaryan"],
        [20,54,63],
        [99,97,93]
    ]
)

df2

       0       1       2
0  Pujen  Naitik  Aaryan
1     20      54      63
2     99      97      93

In [39]:
df3 = pd.DataFrame(
    [
        ["Pujen","Aaryan","Naitik"],
        [20,54,63],
        [99,97,93]
    ],
    index=["name","age","marks"]
)

df3

           0       1       2
name   Pujen  Aaryan  Naitik
age       20      54      63
marks     99      97      93

In [40]:
df3 = pd.DataFrame(
    [
        ["Naitik","Pujen","Aaryan"],
        [20,54,63],
        [99,97,93]
    ],
    columns=["name","age","marks"]
)

df3

     name    age   marks
0  Naitik  Pujen  Aaryan
1      20     54      63
2      99     97      93

In [41]:
type(df3)

pandas.core.frame.DataFrame

## iloc & loc

In [48]:
dd = [
    ["Alice",40,"Los-Angeles"],
    ["Linda",50,"Birmingham"],
    ["Jean",30,"Rome"],
]

df2 = pd.DataFrame(dd,columns=["Name","age","city"])

df2

    Name  age         city
0  Alice   40  Los-Angeles
1  Linda   50   Birmingham
2   Jean   30         Rome

In [49]:
df2["Name"]

0    Alice
1    Linda
2     Jean
Name: Name, dtype: object

In [50]:
df2.Name

0    Alice
1    Linda
2     Jean
Name: Name, dtype: object

In [51]:
df2.Name[0]

'Alice'

In [52]:
df2

    Name  age         city
0  Alice   40  Los-Angeles
1  Linda   50   Birmingham
2   Jean   30         Rome

In [53]:
df2.iloc[0]

Name          Alice
age              40
city    Los-Angeles
Name: 0, dtype: object

In [54]:
df2.iloc[0:2]

    Name  age         city
0  Alice   40  Los-Angeles
1  Linda   50   Birmingham

In [55]:
df2.iloc[0::2]

    Name  age         city
0  Alice   40  Los-Angeles
2   Jean   30         Rome

In [70]:
df2.iloc[0:2,0:2]

    Name  age
0  Alice   40
1  Linda   50

In [57]:
df2

    Name  age         city
0  Alice   40  Los-Angeles
1  Linda   50   Birmingham
2   Jean   30         Rome

In [58]:
df2.loc[0]

Name          Alice
age              40
city    Los-Angeles
Name: 0, dtype: object

#### How to set index from existing column.

In [59]:
df3 = df2.set_index("Name")

In [60]:
df3

       age         city
Name
Alice   40  Los-Angeles
Linda   50   Birmingham
Jean    30         Rome

In [61]:
df3.loc["Linda"]

age             50
city    Birmingham
Name: Linda, dtype: object

In [64]:
df3.loc[["Alice","Jean"]]

       age         city
Name
Alice   40  Los-Angeles
Jean    30         Rome

In [65]:
df3.loc["Alice":"Linda"]

       age         city
Name
Alice   40  Los-Angeles
Linda   50   Birmingham

In [66]:
df3.loc[df3["city"] != "Birmingham"]

       age         city
Name
Alice   40  Los-Angeles
Jean    30         Rome